# KickerBraceSymbol Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
StructuralSettings..::..KickerBraceSymbol Property
StructuralSettings Class See Also
---
The id of the ElementType to represent a kicker brace.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId KickerBraceSymbol { get; set; }
```

Visual Basic
---
```text
Public Property KickerBraceSymbol As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ KickerBraceSymbol {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace